Repository: Mohammad-Ihmeid/mohammad_portfolio
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Hi
ar: مرحباً

source: I’m Mohammad 👋
ar: أنا محمد 👋

# hero_bio
source: I am a Full Stack Developer specializing in Flutter and ASP.NET Core, focused on building high-quality mobile applications that are fast, visually appealing, and user-friendly.With over three years of hands-on experience in mobile development, I still enjoy creating innovative solutions as if it were my very first project.
ar: أنا مطوّر Full Stack أعمل بتقنيات Flutter و ASP.NET Core، أركز على بناء تطبيقات موبايل عالية الجودة تجمع بين الأداء، الجمالية، وسهولة الاستخدام.لدي خبرة عملية تمتد لأكثر من ثلاث سنوات في تطوير تطبيقات موبايل متكاملة وسريعة الاستجابة، وما زلت أستمتع بابتكار حلول جديدة كأنها أول تجربة لي.

source: Amman
ar: عمان

source: Jordan
ar: الأردن

source: Available for new projects
ar: متاح للمشاريع الجديدة

source: Switch Theme
ar: تبديل الثيم

source: Copy
ar: نسخ

source: Copied!
ar: تم النسخ!

source: Contact
ar: اتصال

source: Testimonials
ar: شهادات العملاء

source: Work
ar: عمل

source: About
ar: حول

source: Download CV
ar: تحميل السيرة الذاتية

source: About me
ar: ْعَنِّي

source: Curious about me?
ar: هل أنت فضولي بشأني؟

source: Here you have it
ar: إليك

# bio_intro
source: I’m a passionate Full Stack Mobile Developer specializing in Flutter and ASP.NET Core. I began my journey in 2022 focusing on mobile development, and since then I have been growing steadily, building applications that combine performance, security, and beautiful user interfaces.
ar: أنا مطور Full Stack Mobile شغوف، متخصص في Flutter و ASP.NET Core. بدأت رحلتي في عالم البرمجة عام 2022 بالتركيز على تطوير تطبيقات الموبايل، ومنذ ذلك الوقت وأنا أنمو باستمرار في هذا المجال، حيث أعمل على بناء تطبيقات تجمع بين الأداء العالي، الأمان، والتصميم الجذاب.

# bio_work
source: I work end-to-end across the development lifecycle: from UI/UX design and frontend Flutter implementation, to backend services with ASP.NET Core, database optimization, and deployment. While I enjoy working across the full stack, my main strength lies in delivering smooth and visually appealing Flutter applications that provide real value to users.
ar: أغطي دورة التطوير كاملة: من تصميم واجهات وتجربة المستخدم، إلى بناء الواجهة الأمامية باستخدام Flutter، وتطوير الخدمات الخلفية باستخدام ASP.NET Core، مرورًا بقاعدة البيانات والنشر. ورغم أنني أستطيع العمل على جميع المراحل، إلا أن شغفي الأساسي يتمثل في بناء تطبيقات Flutter سلسة وذات تجربة مستخدم متميزة.

# bio_mindset
source: I’m highly motivated to learn quickly, adapt to new technologies, and refine my coding practices. Writing clean, maintainable, and scalable code is something I deeply care about. User experience and pixel-perfect design matter to me just as much as the technical foundation.
ar: أنا متعلم سريع، أستمتع باستكشاف التقنيات الجديدة، وأسعى دائمًا إلى إتقان مهارات كتابة الكود النظيف والقابل للصيانة والتوسع. كما أنني أهتم بتجربة المستخدم وواجهة التصميم بقدر اهتمامي بجودة التنفيذ التقني.

# bio_stack
source: My core stack includes Flutter, Dart, ASP.NET Core, SQL Server, and Firebase. I also bring experience in DevOps, CI/CD pipelines, and technical leadership where I support teams in building reliable and scalable solutions.
ar: التقنيات الأساسية التي أستخدمها تشمل: Flutter, Dart, ASP.NET Core, SQL Server و Firebase. بالإضافة إلى ذلك، لدي خبرة عملية في DevOps، إعداد CI/CD، وقيادة الفرق التقنية لبناء حلول قابلة للتوسع وموثوقة.

# bio_personal
source: Outside of coding, I enjoy sports and reading. I actively share my projects and learnings on GitHub and LinkedIn, engaging with the tech community and staying up to date with the latest trends.
ar: خارج إطار العمل، أستمتع بالرياضة والقراءة، وأشارك مشاريعي وتجربتي مع مجتمع المطورين عبر GitHub و LinkedIn، مما يساعدني على البقاء على اطلاع دائم بآخر المستجدات.

# bio_facts
source: Quick facts about me:
ar: حقائق سريعة عني:

# bio_fact1
source: • Bachelor’s in Computer Engineering
ar: • بكالوريوس في هندسة الحاسوب

# bio_fact2
source: • Avid Learner who is always exploring new skills
ar: • محب للتعلم المستمر واكتساب المهارات الجديدة

# bio_fact3
source: • Currently a Full-time employee
ar: • موظف دائم حاليًا

# bio_fact4
source: • Open to freelance opportunities and collaborations
ar: • متاح للعمل الحر والتعاون في المشاريع

source: Skills
ar: مهارات

# skills_tools_technologies_really_good
source: The skills, tools and technologies I am really good at:
ar: المهارات والأدوات والتقنيات التي أجيدها حقًا:

source: Experience
ar: خبرات

# summary_of_my_most_recent_experiences
source: Here is a quick summary of my most recent experiences:
ar: فيما يلي ملخص سريع لتجاربي الأخيرة:

# some_of_the_noteworthy_projects
source: Some of the noteworthy projects I have built:
ar: بعض المشاريع الجديرة بالملاحظة التي قمت ببنائها:

# nice_things_people_have_said
source: Nice things people have said about me:
ar: أشياء جميلة قالها الناس عني:

source: Get in touch
ar: تواصل معنا

# feel_free_to_reach
source: What’s next? Feel free to reach out to me if you're looking for a developer, have a query, or simply want to connect.
ar: ما التالي؟ تواصل معي إذا كنت تبحث عن مطور، أو لديك استفسار، أو ترغب ببساطة في التواصل.

source: You may also find me on these platforms!
ar: يمكنك أيضًا العثور علي على هذه المنصات!
